tutorials/flowOverThickPlate/flowOverThickPlate_5deg/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    };

//     p
//     {
//         solver          GAMG;
//         tolerance       1e-09;
//         relTol          0;
//         minIter 1;
//         smoother        GaussSeidel;
//         cacheAgglomeration true;
//         nCellsInCoarsestLevel 10;
//         agglomerator    faceAreaPair;
//         mergeLevels     1;
//     }

    U
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          1000;
        tolerance        1e-10;
        relTol           0;
    };
}

PISO
{
    nOuterCorrectors 2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    
    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}

// ************************************************************************* //
